{
  "profile": {
    "name": "Jose luis Checa",
    "location": "London",
    "email": "joselchecaexpo@gmail.com",
    "linkedin": "linkedin.com/in/joselcheca"
  },
  "summary": "JavaScript developer Specialising in React/Redux creating rich UI APP. Highly driven and experienced professional developer.Whom excels in productive team environments; where I am able tocontribute my wealth of knowledge and leadership;ensuring efficient project completion.Always looking for new challenges, either front or backendto enhance my skills within languages and frameworks in order togrow my technical progression.I am particularly passionate about modern open- source softwaresolutions and how they are transforming our society.",
  "experiences": [
    {
      "id": "9",
      "position": "Software Engineer (Remote contract)",
      "company": "Indeed Flex (Formerly Syft)",
      "date": "Mar 2020 – Present                (1 yr 6 mos)"
    },
    {
      "id": "8",
      "position": "Software Engineer",
      "company": "Syft",
      "date": "Sep 2019 – Present                (2 yrs)"
    },
    {
      "id": "7",
      "position": "React-Redux JavaScript Developer",
      "company": "Arcadia Group Ltd",
      "date": "Jan 2018 – Sep 2019                (1 yr 9 mos)",
      "description": "- Lead the development of an internal project which focused on allowing brands to create content through a CMS, which in return improved delivery times of new content.\n \n- All these task above helped to improve my Front-End / DevOps skills as all of them has been developed by using React 16, Redux, Redux-thunk, Webpack 4, Git and AWS\n\n- At the same time I am trying to keep improve my skills by creating boilerplates and playing with new technologies which you can see on my github account\n\n- Also I was mentorising people about React and vanilla JS"
    },
    {
      "id": "6",
      "position": "React Javascript Developer",
      "company": "Arcadia Group Ltd",
      "date": "Jul 2017 – Jan 2018                (7 mos)",
      "description": "- Working within the content team creating new features for Arcadia Brand websites by improving the Content Renderer platform built in React\n\n - Being part of the deployment process for every new feature created using Git, Jenkins and Aws.\n\n- Improve my React skills"
    },
    {
      "id": "5",
      "position": "Javascript Developer",
      "company": "Ve Global",
      "date": "Oct 2016 – Jul 2017                (10 mos)",
      "description": "Main activities:\n - Maintenance and development of the company's core products - VeCapture and VePanel.\n - Development using ES6 and TypeScript.\n - Using Vanilla JS and browsers' APIs to ensure high performance of applications.\n - Using TDD to give high confidence in quality for critical parts of the code\n - Monitoring of production environment using Application Insights."
    },
    {
      "id": "4",
      "position": "Junior JavaScript Developer",
      "company": "Ve Global",
      "date": "Feb 2016 – Oct 2016                (9 mos)",
      "description": "Creating a new and improved version of my last “Sales automation tool” in order to add more features for an easier and more complete web app customer experience. \nFront-End development: \nJavaScript, HTML, CSS, JQuery, Angular and Bootstrap. \nBack-End development: \nNodeJS, ExpressJS, MySql and also developing a REST API.\nProject manager for this and involved in all aspects from workflow to design to testing.\n\nAt the same time I'm the main contact between Hong Kong office and here the head-quarter in London."
    },
    {
      "id": "3",
      "position": "Head of Technical Services",
      "company": "Ve Global",
      "date": "Mar 2015 – Sep 2016                (1 yr 7 mos)",
      "description": "Managing a team of tech from senior to junior level, leading them to increase our output, consisting of; setting up new campaigns, fixing client issues and maintaining clients. \n\nMain contact between our headquarter in London regarding new process and updates.\n\nCreated a “Sales automation tool” to increase sales process and on boarding new clients. Front-End development using: JavaScript, HTML, CSS, PHP, Jquery and JSFrameworks. Project manager for this and involved in all aspects from workflow to design to testing. Used a repositories for a remote coordination work."
    },
    {
      "id": "2",
      "position": "Technical Team Leader / Senior Technical Support Analyst",
      "company": "Ve Global",
      "date": "Sep 2014 – Jan 2015                (5 mos)",
      "description": "- Using experience/knowledge from previous role to lead a team of up to 7 Technical Support Analysts, work on email campaigns, the founding technology offering of the company.\n- Managing, delegating and allocating daily work/projects.\n- Training staff and monitoring their performance and progression in my team, as well as assisting in their movement to other teams for their skill expansion and professional growth.\n- Customizing JavaScript"
    },
    {
      "id": "1",
      "position": "Technical Support Analyst",
      "company": "Ve Global",
      "date": "Jan 2014 – Sep 2014                (9 mos)",
      "description": "Main activities: \n\n• Creation, changes and corrections of HTML emails \n- creating email campaigns for clients \n(e.g. setting up A/B test campaigns in order to compare the best performing email; CASCADE campaigns – delivery of 2/3 steps emails with different messages and layouts; etc)\n- creating distribution lists\n(when necessary, setting up criteria filters – e.g. sending different emails according to the total basket value, the country, the shipping method, the language, type of product, etc.)\n- according to the campaign chosen by each client, creation of html email templates \n(e.g. Product Feed email, generic email, personalized email – with body or subject line personalized with the customer’s first name)\n- creating emails compatible with Gmail, Outlook and mobile devices\n• Use of Komodo\n• Use of the company’s internal system to upload and delivery email campaigns (VeContact by Ve Interactive)\n• JavaScript configuration \n• JQuery\n• CSS\n• Solving tech issues and problems arising from clients’ campaigns to ensure their best performance\n• Responding to tech questions and queries promptly and efficiently within SLA"
    },
    {
      "id": "0",
      "position": "Junior Programmer",
      "company": "CITEC",
      "date": "Oct 2012 – Apr 2013                (7 mos)",
      "description": "Creation of an artificial language to control an IPTV3D3I platform through voice."
    }
  ],
  "education": [
    {
      "id": "0",
      "school": "Universidad de Córdoba",
      "degree": "Technical Engineering in Computer Science, Gestion"
    }
  ],
  "licensesAndCertifications": [
    {
      "id": "10",
      "name": "Sketch 3: learn to create mobile and web designs",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Feb 2016"
    },
    {
      "id": "9",
      "name": "Python, The Next Level (Intermediate)",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Aug 2017"
    },
    {
      "id": "8",
      "name": "Angular 4 (formerly Angular 2) - The Complete Guide                           ",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Aug 2017"
    },
    {
      "id": "7",
      "name": "Introduction to Python for Data Science",
      "issuingOrganization": "edX",
      "issuedAt": "Issued Aug 2017"
    },
    {
      "id": "6",
      "name": "Color for Design and Art",
      "issuingOrganization": "Lynda.com",
      "issuedAt": "Issued Nov 2017"
    },
    {
      "id": "5",
      "name": "Microsoft Power BI - A Complete Introduction",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Dec 2018"
    },
    {
      "id": "4",
      "name": "Apache Kafka Series - Learn Apache Kafka for                            Beginners v2",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Jul 2019"
    },
    {
      "id": "3",
      "name": "Apache Kafka Series - Kafka Cluster Setup &                            Administration",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Jul 2019"
    },
    {
      "id": "2",
      "name": "Apache Kafka Series - Kafka Monitoring &                            Operations",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Jul 2019"
    },
    {
      "id": "1",
      "name": "Apache Kafka Series - Confluent Schema Registry                            & REST Proxy",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Sep 2019",
    },
    {
      "id": "0",
      "name": "Apache Kafka Series - Kafka Security (SSL SASL                            Kerberos ACL)",
      "issuingOrganization": "Udemy",
      "issuedAt": "Issued Oct 2019"
    }
  ],
  "skills": [
    "Node.js",
    "JavaScript",
    "JSON",
    "Test Driven Development",
    "Software Development",
    "React.js",
    "CSS",
    "HTML",
    "MongoDB",
    "MySQL"
  ],
  "honorsAndAwards": [
    {
      "id": "1",
      "title": "Test for honors",
      "date": "Nov 2014",
      "description": "The ReHand project was distinguished with this prize"
    },
  ]
}